const kitties = [
	"   ____\n" +
	"  (.   \\\n" +
	"    \\  |  \n" +
	"     \\ |___(\\--/)\n" +
	"   __/    (  . . )\n" +
	"  \"'._.    '-.O.'\n" +
	"       '-.  \\ \"|\\\n" +
	"          '.,,/'.,,mrf",

	" ((      /|_/|\n" +
	"  \\\\.._.'  , ,\\\n" +
	"  /\\ | '.__ v /\n" +
	" (_ .   /   \"        \n" +
	"  ) _)._  _ /\n" +
	" '.\\ \\|( / ( mrf\n" +
	"   '' ''\\\\ \\\\",

	"   |\\      _,,,---,,_\n" +
	"   /,`.-'`'    -.  ;-;;,_\n" +
	"  |,4-  ) )-,_..;\\ (  `'-'\n" +
	" '---''(_/--'  `-'\\_) ",

	"                   .-o=o-.\n" +
	"               ,  /=o=o=o=\\ .--.\n" +
	"              _|\\|=o=O=o=O=|    \\\n" +
	"          __.'  a`\\=o=o=o=(`\\   /\n" +
	"          '.   a 4/`|.-\"\"'`\\ \\ ;'`)   .---.\n" +
	"            \\   .'  /   .--'  |_.'   / .-._)\n" +
	"             `)  _.'   /     /`-.__.' /\n" +
	"          jgs `'-.____;     /'-.___.-'\n" +
	"                       `\"\"\"`",

	"   ╱|、\n" +
	" (˚ˎ 。7  \n" +
	"  |、˜〵          \n" +
	" じしˍ,)ノ",

	"  ∧,,,∧\n" +
	"(  ̳• · • ̳)\n" +
	"/    づ♡",

	": ¨·.·¨ :\n" +
	" ` ·. 🦋\n" +
	"                  ╱|、                   \n" +
	"                (˚ˎ 。7  \n" +
	"                 |、˜〵          \n" +
	"                じしˍ,)ノ           ",

	"           _.._      (\\-.)\n" +
	"         .'    '-._.'  ..\\\n" +
	"        /   -.     \\  = T/=\n" +
	"       |      )     `6'-`\n" +
	"       ; ;   '-._,  /-._\n" +
	"        \\ \\:-._) '-._)._)\n" +
	"    jgs  \\ '--.\n" +
	"          `\"\"`",

	"               _ |\\_      \n" +
	"               \\` ..\\  \n" +
	"          __,.-\" =__Y=\n" +
	"  jgs   .\"        )\n" +
	"  _    /   ,    \\/\\_  _ \n" +
	" ((____|    )_-\\ \\_-`(_)\n" +
	" `-----'`-----` `--`",
]

function rkitty() {
	return kitties[Math.floor(Math.random() * kitties.length)]
}

console.log(`Welcome to Quarklight!
Here is a kitten for you

${rkitty()}

You can find the source code for this project at
https://github.com/vtheskeleton/quarklight
🏳️‍⚧️

You can get a new kitty with kitty()`)

function kitty() {
	console.log(rkitty())
}